tutorials/heatTransfer/buoyantBoussinesqSimpleSolver/iglooWithFridges/0/U
/*---------------------------------------------------------------------------*
Caelus 10.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    ground
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    igloo_region0
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    twoFridgeFreezers_seal_0
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    twoFridgeFreezers_herring_1
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
