tutorials/heatTransfer/buoyantBoussinesqSimpleSolver/iglooWithFridges/system/decomposeParDict
/*---------------------------------------------------------------------------*
Caelus 10.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 6;

method         scotch;

simpleCoeffs
{
    n               ( 4 1 1 );
    delta           0.001;
}

hierarchicalCoeffs
{
    n               ( 3 2 1 );
    delta           0.001;
    order           xyz;
}

manualCoeffs
{
    dataFile        "cellDecomposition";
}


// ************************************************************************* //
